{
  "the-blood-empress": {
    "id": 44,
    "name": "The Blood Empress",
    "name_anchor": "the-blood-empress",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-blood-empress",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "U",
    "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|Whenever a nontoken creature an opponent controls dies, you get {b} (A blood counter).|{2}, Pay {b}{b}: Choose one —|• Create a 1/1 colorless Spirit creature token.|• Tap or untap target permanent.|• Each opponent loses 2 life and you gain 2 life.|• Draw a card.",
    "flavor": "",
    "artist": "rkpost",
    "rulings": [
      "{b} is the blood symbol. It represents one blood counter.",
      "Blood counters are a kind of counter that a player may have. They’re not associated with specific permanents. (Other kinds of counters that players may have include poison, energy and experience.)",
      "Keep careful track of how many blood counters the Leader player has. You may do so by keeping a running count on paper, by using a die on that card, or by any other clear and mutually agreeable method.",
      "If an effect says you get one or more {b}, you get that many blood counters. To pay one or more {b}, you lose that many blood counters. Any effects that interact with counters a player gets, has, or loses can interact with blood counters.",
      "Blood counters aren’t mana. They don’t go away as steps, phases, and turns end, and effects that add mana \"of any type\" to your mana pool can’t give you blood counters.",
      "You can’t pay more blood counters than you have."
    ]
  },

  "the-chaos-bringer": {
    "id": 45,
    "name": "The Chaos Bringer",
    "name_anchor": "the-chaos-bringer",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-chaos-bringer",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "R",
    "text": "At the beginning of your upkeep, roll a six-sided die. This ability has the indicated effect.|1 — Do nothing.|2 — Scry 1.|3 — You gain 3 life.|4 — Create a 1/1 colorless Eldrazi Scion creature token. It has “Sacrifice this creature: Add {C}.”|5 — Draw a card.|6 — Repeat this process two more times.",
    "flavor": "",
    "artist": "One Vox",
    "rulings": [
      "You roll a die as The Chaos Bringer’s ability resolves. No player may take actions between seeing the result of the roll and completing the ability’s resolution."
    ]
  },

  "the-corrupted-regent": {
    "id": 46,
    "name": "The Corrupted Regent",
    "name_anchor": "the-corrupted-regent",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-corrupted-regent",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "M",
    "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|At the beginning of your draw step, you may draw an additional card. If you do, choose a card in your hand drawn this turn. Pay 3 life or put that card on top of your library.",
    "flavor": "",
    "artist": "ArchLimit (Leo Li) @ DeviantArt",
    "rulings": [
      "You always perform your normal draw before this ability. The normal draw occurs before anything can be placed on the stack during a player’s draw step.",
      "If you control other triggered abilities that allow you to draw cards during your draw step, you can choose to order The Corrupted Regent’s ability before or after those abilities. Triggered abilities controlled by other players will resolve before triggered abilities you control.",
      "Any cards drawn prior to The Corrupted Regent’s ability resolving, including in your upkeep or in response to The Corrupted Regent’s triggered ability, can be chosen to be put back using this effect. The Corrupted Regent’s controller is responsible for keeping these cards distinguishable in hand, such as by keeping them separate from cards that began the turn in hand.",
      "You can put back zero or one card.",
      "If you choose to draw a card, then replace that draw with some other effect, the rest of The Corrupted Regent’s ability still happens. If you’ve actually drawn only one card that turn, you must choose that card and either pay 3 life or put it on top of your library. If you haven’t actually drawn any cards that turn, the rest of the ability has no effect.",
      "It’s not possible to take any actions between drawing the cards and choosing a card. You can’t cast the cards you drew to avoid having a card to choose."
    ]
  },

  "the-gathering": {
    "id": 47,
    "name": "The Gathering",
    "name_anchor": "the-gathering",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-gathering",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "M",
    "text": "At the beginning of your upkeep, you may choose one that hasn’t been chosen —|• White — You gain 8 life.|• Blue — Draw two cards.|• Black — Destroy target creature or planeswalker.|• Red — Create three 1/1 red Goblin creature tokens.|• Green — Destroy target artifact, enchantment, or land.",
    "flavor": "",
    "artist": "HarryBuddhaPalm (Justin Reed) @ DeviantArt",
    "rulings": [
      "You choose the mode as the triggered ability goes on the stack. You can choose a mode that requires targets only if there are legal targets available.",
      "If the ability is countered (either for having its target become illegal or because a spell or ability counters it), the mode chosen for that instance of the ability still counts as being chosen.",
      "The phrase \"that hasn’t been chosen\" refers only to that specific The Gathering.",
      "It doesn’t matter who has chosen any particular mode. For example, say you control The Gathering and have chosen the first three modes. If an opponent gains control of The Gathering, that player can choose only the fourth or fifth mode.",
      "In some very unusual situations, you may not be able to choose a mode, either because all modes have previously been chosen or the only remaining modes require targets and there are no legal targets available. In this case, the ability is simply removed from the stack with no effect.",
      "Keep careful track of which modes the Leader player has already chosen. You may do so by keeping a running count on paper, by using colored counters on that card, by using one basic land card of each color under that card, or by any other clear and mutually agreeable method."
    ]
  },

  "her-seedborn-highness": {
    "id": 48,
    "name": "Her Seedborn Highness",
    "name_anchor": "her-seedborn-highness",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=her-seedborn-highness",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "U",
    "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|Start the game with a number of seed counters on Her Seedborn Highness equal to the number of players.|{3}, Remove a seed counter from Her Seedborn Highness: Untap all permanents you control. Activate this ability only once each turn.",
    "flavor": "",
    "artist": "Jason Engle @ DeviantArt",
    "rulings": ["No extra rules information."]
  },

  "his-beloved-majesty": {
    "id": 49,
    "name": "His Beloved Majesty",
    "name_anchor": "his-beloved-majesty",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=his-beloved-majesty",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "M",
    "text": "At the beginning of your upkeep, starting with the next player in turn order, each non-Leader player may choose a nonenchantment, nontoken permanent they control and draw a card. For each player who does, gain control of that permanent and untap it. If no one does, you draw a card.",
    "flavor": "",
    "artist": "Armandeo @ Terminally Incoherent",
    "rulings": [
      "Other players decide in turn order whether or not they accept the offering (choosing a nonenchantment, nontoken permanent and drawing a card). Each player will know the decisions of previous players in turn order when making their decision.",
      "After each other player has decided, the stealing effect happens simultaneously for each one who accepted the offering."
    ]
  },

  "the-king-over-the-scrapyard": {
    "id": 50,
    "name": "The King over the Scrapyard",
    "name_anchor": "the-king-over-the-scrapyard",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-king-over-the-scrapyard",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "R",
    "text": "Whenever a spell or ability an opponent controls destroys or exiles a nontoken permanent you control, create a colorless Junk artifact token with “Sacrifice this artifact: Add {C}{C}.”|Sacrifice two Junks: Draw a card.",
    "flavor": "",
    "artist": "Ralph Horsley @ DeviantArt",
    "rulings": [
      "A spell or ability that asks for a sacrifice will not trigger this card.",
      "The King Over the Scrapyard will not trigger if an opponent’s spell or ability causes your permanent to be destroyed indirectly. For example, if the spell caused an ability you control to trigger, and thereby destroy your permanent."
    ]
  },

  "the-old-ruler": {
    "id": 51,
    "name": "The Old Ruler",
    "name_anchor": "the-old-ruler",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-old-ruler",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "U",
    "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|Your starting life total is increased by 10.|Your starting hand size and your maximum hand size are each increased by one.|The first spell you cast during each of your turns costs {1} less to cast.",
    "flavor": "",
    "artist": "AnthonyFoti (Tony Foti) @ DeviantArt",
    "rulings": [
      "Even though your starting hand size is increased by one, nothing else about the pregame procedure changes. If you don’t take two or more mulligans in a multiplayer game, you won’t be able to \"scry\" before the game starts.",
      "If there are additional costs to cast a spell, or if the cost to cast a spell is increased by an effect, apply those increases before applying cost reductions.",
      "The cost reduction can apply to an alternative cost, such as a madness cost.",
      "If the first spell you cast in your turn has {X} in its mana cost, you choose the value of X before calculating the spell’s total cost. For example, if the first spell you cast in a turn has a mana cost of {X}{U}, you could choose 1 as the value of X and pay {U} to cast the spell."
    ]
  },

  "the-queen-of-light": {
    "id": 52,
    "name": "The Queen of Light",
    "name_anchor": "the-queen-of-light",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-queen-of-light",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "U",
    "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|Start the game with a number of purification counters on The Queen of Light equal to half the number of players, rounded down.|{3}, Remove a purification counter from The Queen of Light: Exile a permanent of your choice. (This ability doesn’t target anything. You choose a permanent as it resolves.)",
    "flavor": "",
    "artist": "Jason Engle @ DeviantArt",
    "rulings": [
      "The affected permanent isn’t targeted. The Leader player may choose a permanent with shroud, for example.",
      "Once The Queen of Light’s ability begins to resolve, no players may take other actions until it’s done. Notably, players can’t try to save their permanent after you’ve chosen it."
    ]
  },

  "the-twin-princesses": {
    "id": 53,
    "name": "The Twin Princesses",
    "name_anchor": "the-twin-princesses",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-twin-princesses",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "R",
    "text": "(Start the game with this identity face up in the command zone. You are the starting player.)|{2}: Copy target activated or triggered ability you control. You may choose new targets for the copy. Activate this ability only once each turn. (Mana abilities can’t be targeted.)",
    "flavor": "",
    "artist": "phoenixlu @ DeviantArt",
    "rulings": [
      "Activated abilities contain a colon. They’re written in the form \"[Cost]: [Effect].\" Some keyword abilities, such as equip and crew, are activated abilities and will have colons in their reminder texts.",
      "Triggered abilities use the word \"when,\" \"whenever,\" or \"at.\" They’re often written as \"[Trigger condition], [effect].\" Some keyword abilities, such as prowess and fabricate, are triggered abilities and will have \"when,\" \"whenever,\" or \"at\" in their reminder text.",
      "The Twin Princess’ ability targets an activated or triggered ability that was activated or has triggered and is on the stack. It creates another instance of that ability on the stack. It doesn’t cause any object to gain an ability.",
      "The source of the copy is the same as the source of the original ability.",
      "If the activated or triggered ability is modal (that is, if it says, “Choose one —” or similar), the mode is copied and can’t be changed.",
      "If the activated or triggered ability divides damage or distributes counters among a number of targets (for example, the ability of Bogardan Hellkite), the division and number of targets can’t be changed. If you choose new targets, you must choose the same number of targets.",
      "Any choices made when the activated or triggered ability resolves won’t have been made yet when it’s copied. Any such choices will be made separately when the copy resolves. If the activated or triggered ability asks you to pay a cost (such as that of Frenzied Goblin), you pay that cost for the copy.",
      "If a triggered ability is linked to a second ability, copies of that triggered ability are also linked to that second ability. If the second ability refers to \"the exiled card,\" it refers to all cards exiled by the triggered ability and the copy. For example, if Oblivion Ring’s enters-the-battlefield ability is copied and two permanents are exiled, they both return when Oblivion Ring leaves the battlefield.",
      "In some cases involving linked abilities, an ability requires information about \"the exiled card.\" When this happens, the ability gets multiple answers. If these answers are being used to determine the value of a variable, the sum is used. For example, if Elite Arcanist’s enters-the-battlefield ability is copied, two cards are exiled. The value of X in the activation cost of Elite Arcanist’s other ability is the sum of the two cards’ converted mana costs. As the ability resolves, you create copies of both cards and can cast none, one, or both of the copies in any order.",
      "A mana ability is an ability that (1) isn’t a loyalty ability, (2) doesn’t target, and (3) could put mana into a player’s mana pool when it resolves."
    ]
  },

  "the-void-tyrant": {
    "id": 54,
    "name": "The Void Tyrant",
    "name_anchor": "the-void-tyrant",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-void-tyrant",
    "cost": "",
    "cmc": 0,
    "color": "multicolor",
    "type": "Identity — Leader",
    "types": {
      "supertype": "Identity",
      "subtype": "Leader"
    },
    "rarity": "R",
    "text": "Start the game with a number of void counters on The Void Tyrant equal to half the number of players, rounded down.|{3}, Remove a void counter from The Void Tyrant: Counter target spell or ability from a nonidentity source. (Mana abilities can’t be targeted.)",
    "flavor": "",
    "artist": "Grivetart (Bastien Grivet) @ DeviantArt",
    "rulings": [
      "Activated abilities contain a colon. They’re written in the form \"[Cost]: [Effect].\" Some keyword abilities, such as equip and crew, are activated abilities and will have colons in their reminder texts.",
      "Triggered abilities use the word \"when,\" \"whenever,\" or \"at.\" They’re often written as \"[Trigger condition], [effect].\" Some keyword abilities, such as prowess and fabricate, are triggered abilities and will have \"when,\" \"whenever,\" or \"at\" in their reminder text.",
      "Only activated and triggered abilities on the stack can be countered. Static abilities of objects can’t be targeted.",
      "If you counter a delayed triggered ability that triggers at the beginning of the \"next\" occurrence of a specified step or phase, that ability won’t trigger again the following time that phase or step occurs.",
      "An activated mana ability is one that adds mana to a player’s mana pool as it resolves, doesn’t have a target, and isn’t a loyalty ability. A triggered mana ability is one that adds mana to a player’s mana pool and triggers on an activated mana ability.",
      "Abilities that create replacement effects, such as a permanent entering the battlefield tapped or with counters on it, can’t be targeted. Abilities that apply \"as [this creature] enters the battlefield\" are also replacement effects and can’t be targeted."
    ]
  }
}
