{
  "the-banisher": {
    "id": 17,
    "name": "The Banisher",
    "name_anchor": "the-banisher",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-banisher",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Banisher.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "U",
    "text": "Unveil {7} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Banisher is unveiled, exile any number of target creatures. Draw a card for each nontoken creature exiled this way.",
    "flavor": "",
    "artist": "Boota17 @ DeviantArt",
    "rulings": ["No extra rules information."]
  },

  "the-cleaner": {
    "id": 18,
    "name": "The Cleaner",
    "name_anchor": "the-cleaner",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-cleaner",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Cleaner.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "R",
    "text": "Unveil {8} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Cleaner is unveiled, if it’s your main phase, exile all nonland permanents you don’t control.",
    "flavor": "",
    "artist": "Snook-8 @ DeviantArt",
    "rulings": ["No extra rules information."]
  },

  "the-ferryman": {
    "id": 19,
    "name": "The Ferryman",
    "name_anchor": "the-ferryman",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-ferryman",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Ferryman.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "M",
    "text": "Unveil {1}|When The Ferryman is unveiled, choose target permanent. When that permanent is put into a graveyard this turn, return another target card that shares a card type with it from its owner’s graveyard to the battlefield under your control.|{3}: Turn The Ferryman face down. Activate this ability only during your turn and only once each turn.",
    "flavor": "",
    "artist": "Andrew Hou",
    "rulings": [
      "All The Ferryman does when it resolves is set up a delayed triggered ability. If the targeted permanent isn’t put into a graveyard this turn, that ability never triggers. If the targeted permanent is put into a graveyard this turn, that ability triggers and resolves like any other triggered ability.",
      "The permanent card that will be returned to the battlefield isn’t chosen until the delayed triggered ability resolves. The player who chooses is the player who controlled The Ferryman.",
      "The permanent that’s returned to the battlefield can’t be the same one that was put into the graveyard (assuming it’s still in the graveyard when the delayed triggered ability resolves)."
    ]
  },

  "the-gatekeeper": {
    "id": 20,
    "name": "The Gatekeeper",
    "name_anchor": "the-gatekeeper",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-gatekeeper",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Gatekeeper.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "U",
    "text": "Unveil {5} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Gatekeeper is unveiled, create Cerberus, a legendary 3/6 black and red Hound creature token with menace, double strike, trample, and lifelink.|{3}: Turn The Gatekeeper face down.",
    "flavor": "",
    "artist": "Pierluigi Abbondanza @ DeviantArt",
    "rulings": [
      "The Gatekeeper’s last ability (turning face down) can be activated only while the identity card is face up.",
      "If you turn The Gatekeeper face down, your opponents will still remember your role."
    ]
  },

  "the-grenadier": {
    "id": 21,
    "name": "The Grenadier",
    "name_anchor": "the-grenadier",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-grenadier",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Grenadier.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "U",
    "text": "Unveil {X} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Grenadier is unveiled, create X colorless artifact tokens named Explosive. They have “{2}, {T}, Sacrifice this artifact: Destroy target nonland permanent. Its controller loses 2 life.”",
    "flavor": "",
    "artist": "Kekai @ CGHUB",
    "rulings": [
      "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X."
    ]
  },

  "the-metamorph": {
    "id": 22,
    "name": "The Metamorph",
    "name_anchor": "the-metamorph",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-metamorph",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Metamorph.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "M",
    "text": "Unveil—Pay 8 life, Discard a card.|When The Metamorph is unveiled, until end of turn, as an opponent loses the game, you may put The Metamorph outside the game. If you do, gain control of that player’s identity card and turn it face down.",
    "flavor": "",
    "artist": "Myrmirada (Anna Verhoog) @ DeviantArt",
    "rulings": [
      "You can’t pay the unveil cost if you have no cards in hand or if your life total is less than 8.",
      "You may steal the Leader player’s identity card as they lose the game. If you do, the game will go on.",
      "A Leader identity card can be turned face down. It will have no characteristics and you won’t be able to turn it face up if it doesn’t have Unveil. However, your win conditions still change according to that role. Players will be able to track a Leader identity card turned face down this way until it’s shuffled in a face-down pile or it becomes a new object. (See rule 707.6 in the official CR, the same is true for a face-down identity card.)",
      "\"Put outside the game\" means to remove it from game, not exiling it. The same identity card can be put outside the game only once.",
      "If the game is restarted and The Metamorph was put outside the game, it comes back to the new game. This is an exception to rule 108.5 in the official CR due to rule 716.2 in the official CR taking precedence. The previously stolen identity card in the restarted game will leave the game as its original owner has lost that game.",
      "The Metamorph’s replacement effect will apply no matter how a player loses the game: due to a state-based action (as a result of having a life total of 0 or less, trying to draw a card from an empty library, or having ten poison counters), a spell or ability that says that player loses the game, a concession, or a game loss awarded by a judge.",
      "In a multiplayer game using the limited range of influence option (such as a Grand Melee game), if a spell or ability says that you win the game, it instead causes all of your opponents within your range of influence to lose the game. This is another way by which The Metamorph’s replacement effect can apply.",
      "Your win conditions change according to your new role."
    ]
  },

  "the-oneiromancer": {
    "id": 23,
    "name": "The Oneiromancer",
    "name_anchor": "the-oneiromancer",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-oneiromancer",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Oneiromancer.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "U",
    "text": "Unveil {X}{X} (Start the game with this identity face down in the command zone. Turn it face up any time for its unveil cost.)|When The Oneiromancer is unveiled, each player exiles the top X cards of their library face down.|You may look at and cast cards exiled with The Oneiromancer without paying their mana costs. You can’t cast more than one spell this way each turn.",
    "flavor": "",
    "artist": "Hamsterfly (Viktor Titov) @ DeviantArt",
    "rulings": [
      "The X in the unveiling triggered ability has the same value as the X paid in the Unveil ability. This is pretty easy to derive since there is no other source of X.",
      "An effect that instructs you to \"cast\" a card doesn’t allow you to play lands.",
      "If another player gains control of The Oneiromancer, that player can see all of the exiled cards and may play them. Once a player looks at a face-down exiled card, that player may look at that card any time later in the game.",
      "The Oneiromancer doesn’t change when you can cast the exiled card. For example, if you exile a creature card without flash, you can cast it only during your main phase when the stack is empty.",
      "Because you’re already casting the cards using an alternative cost (by casting them without paying their mana costs), you can’t pay any other alternative costs for the cards, including casting them face down using the morph ability. You can pay additional costs, such as kicker costs. If the cards have any mandatory additional costs, you must pay those.",
      "If a card has {X} in its mana cost, you must choose 0 as the value for X when casting it.",
      "Any cards you don’t cast this way will remain in exile.",
      "Casting the card causes it to leave exile. You can’t cast it multiple times.",
      "If you leave the game, the cards remain exiled face down indefinitely. No player may look at them."
    ]
  },

  "the-puppet-master": {
    "id": 24,
    "name": "The Puppet Master",
    "name_anchor": "the-puppet-master",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-puppet-master",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Puppet%20Master.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "M",
    "text": "Unveil {8}|When The Puppet Master is unveiled, if it’s your turn, redistribute control of any number of other identity cards. Then, turn face down each of those cards that isn’t a Leader. (Each opponent must control one identity card.)|At the beginning of your end step, draw a card.",
    "flavor": "",
    "artist": "fuuryoku (Thom Scott) @ DeviantArt",
    "rulings": [
      "Except for you, you choose which player gets which identity card when the unveiling triggered ability resolves.",
      "Other players can respond to The Puppet Master's unveiling triggered ability. They can use their own Identity's unveil ability while they have priority. Afterwards, those identity cards could be turned face down during the resolution of The Puppet Master's ability.",
      "Once The Puppet Master’s unveiling triggered ability begins to resolve, no player may take other actions until it’s done. Notably, opponents won’t be allowed to unveil their identity card.",
      "When The Puppet Master’s unveiling triggered ability starts to resolve, for each other player, you can choose to (a) leave their identity card as they are or (b) exchange control of that identity with another one (not being The Puppet Master). You can’t choose to have a player controls no identity card.",
      "Except for The Puppet Master and the Leader, you choose which identity card is turned face down. You may choose an identity card whose control didn’t change.",
      "If a player concedes during the resolution of The Puppet Master's unveiling triggered ability, their identity card leaves the game and no one gains control of it. If that player would have gained control of another identity card, instead assign that identity card to another player with no identity card assigned.",
      "The Puppet Master’s last ability can trigger only while the identity card is face up.",
      "Each player’s win conditions change according to their new role."
    ]
  },

  "the-reflector": {
    "id": 25,
    "name": "The Reflector",
    "name_anchor": "the-reflector",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-reflector",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Reflector.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "R",
    "text": "Unveil {6}|When The Reflector is unveiled, gain control of target ability, instant, or sorcery spell. You may choose new targets for it. Then copy that spell or ability for each opponent. You may choose new targets for the copies.",
    "flavor": "",
    "artist": "LeeJJ (Jon Lee) @ DeviantArt",
    "rulings": [
      "The Reflector’s unveiling triggered ability can target any instant or sorcery spell, or ability on the stack, even one without targets. Static abilities of objects can’t be targeted.",
      "If you gain control of an instant or sorcery spell, it will be put into its owner’s graveyard as it resolves.",
      "If you gain control of an instant or sorcery spell for which a Buyback cost has been paid, the card returns to its owner’s hand.",
      "You may change any or none of the spell’s targets. If you change a target, you must choose a legal target for the spell. If you can’t, you must leave the target unchanged (even if the current target is illegal). Notably, if you were originally chosen as a \"target opponent\" for a spell you gain control with The Reflector, you are now an illegal target as you aren’t your own opponent.",
      "If the target is removed from the stack (e.g. countered) before the unveiling ability resolves, The Reflector will fizzle and do nothing as it is its only target."
    ]
  },

  "the-time-bender": {
    "id": 26,
    "name": "The Time Bender",
    "name_anchor": "the-time-bender",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-time-bender",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Time%20Bender.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "R",
    "text": "Unveil {6}|When The Time Bender is unveiled, choose two —|• Each player shuffles their hand and graveyard into their library, then draws seven cards.|• Take an extra turn after this one.|• End the turn.",
    "flavor": "",
    "artist": "Unknown",
    "rulings": [
      "If multiple \"extra turn\" effects resolve in the same turn, take them in the reverse of the order that the effects resolved.",
      "If any abilities trigger while players are shuffling cards into their library or drawing seven cards, those abilities cease to exist when the turn ends. They won’t be put on the stack.",
      "Ending the turn this way means the following things happen in order: 1) All spells and abilities on the stack are exiled. This includes spells and abilities that can’t be countered. 2) If there are any attacking and blocking creatures, they’re removed from combat. 3) State-based actions are checked. No player gets priority, and no triggered abilities are put onto the stack. 4) The current phase and/or step ends. The game skips straight to the cleanup step. 5) The cleanup step happens in its entirety.",
      "If any triggered abilities do trigger during this process, they’re put onto the stack during the cleanup step. If this happens, players will have a chance to cast spells and activate abilities, then there will be another cleanup step before the turn is over.",
      "Though other spells and abilities that are exiled won’t get a chance to resolve, they don’t count as being countered.",
      "Any \"at the beginning of the next end step\" triggered abilities won’t get the chance to trigger that turn because the end step is skipped. Those abilities will trigger at the beginning of the end step of the next turn.",
      "If both your hand and graveyard are empty as The Time Bender’s unveiling triggered ability starts resolving, you’ll still shuffle your library before drawing seven cards."
    ]
  },

  "the-wearer-of-masks": {
    "id": 27,
    "name": "The Wearer of Masks",
    "name_anchor": "the-wearer-of-masks",
    "uri": "https://mtgtreachery.net/rules/oracle/?card=the-wearer-of-masks",
    "image": "https://mtgtreachery.net/images/cards/en/trd/Traitor%20-%20The%20Wearer%20of%20Masks.jpg",
    "cost": "",
    "cmc": 0,
    "color": "black",
    "type": "Identity — Traitor",
    "types": {
      "supertype": "Identity",
      "subtype": "Traitor"
    },
    "rarity": "M",
    "text": "Unveil {0}|As The Wearer of Masks is unveiled, choose four Traitor identity cards at random from outside the game. You may pay the unveil cost of one of those cards. If you do, until The Wearer of Masks is turned face down, it becomes a copy of that identity. If you don’t, turn The Wearer of Masks face down at the beginning of your next end step.",
    "flavor": "",
    "artist": "moonxels (David Demaret) @ DeviantArt",
    "rulings": [
      "To choose four Traitor identity cards at random, you may for example shuffle the remaining ones from outside the game in a face-down pile, then choose and reveal the top four cards of that pile.",
      "The Wearer of Masks’ ability to become a copy is a replacement effect. Because turning an identity face up and applying replacement effects both don’t use the stack, players won’t be able to take actions between the time you announce that you’re turning The Wearer of Masks face up and the time it has become a copy of the identity of your choice.",
      "If you pay an Unveil cost with a {X}, you may choose a value for X.",
      "If an ability from the chosen identity card refers to X, it has the same chosen value as you paid the Unveil cost during the resolution of The Wearer of Masks’ ability.",
      "Any \"[when/as] [this identity] is unveiled\" abilities of the chosen identity card will work if The Wearer of Masks is unveiled. Any \"[when/as] [this identity] is turned face up\" abilities of the chosen identity card will work if The Wearer of Masks is turned face up or unveiled.",
      "When The Wearer of Masks is turned face down, its copy effect wears off. While it’s face down, it’s a Traitor identity card that can be turned face up for an unveil cost of {0}."
    ]
  }
}
